Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnn--nnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000--00000000000" edc:name="IFS3" edc:nzwidth="32" edc:por="0000000000000000000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD37IF" edc:desc="" edc:mask="0x1" edc:name="ADCD37IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD38IF" edc:desc="" edc:mask="0x1" edc:name="ADCD38IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD39IF" edc:desc="" edc:mask="0x1" edc:name="ADCD39IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD40IF" edc:desc="" edc:mask="0x1" edc:name="ADCD40IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD41IF" edc:desc="" edc:mask="0x1" edc:name="ADCD41IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD42IF" edc:desc="" edc:mask="0x1" edc:name="ADCD42IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD43IF" edc:desc="" edc:mask="0x1" edc:name="ADCD43IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBSRIF" edc:desc="Interrupt Flag Status bits" edc:mask="0x1" edc:name="USBSRIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:desc="" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDCIF" edc:desc="" edc:mask="0x1" edc:name="CFDCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBIF" edc:desc="" edc:mask="0x1" edc:name="SBIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNHIF" edc:desc="" edc:mask="0x1" edc:name="CNHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNJIF" edc:desc="" edc:mask="0x1" edc:name="CNJIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIF" edc:desc="" edc:mask="0x1" edc:name="CNKIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xfffff7ff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810080" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:desc="" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBDMAIF" edc:desc="" edc:mask="0x1" edc:name="USBDMAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2IF" edc:desc="" edc:mask="0x1" edc:name="CAN2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ETHIF" edc:desc="" edc:mask="0x1" edc:name="ETHIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:desc="" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:desc="" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3BIF" edc:desc="" edc:mask="0x1" edc:name="I2C3BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:desc="" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:desc="" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:desc="" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIF" edc:desc="" edc:mask="0x1" edc:name="PREIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SQI1IF" edc:desc="" edc:mask="0x1" edc:name="SQI1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:desc="" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:desc="" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:desc="" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5EIF" edc:desc="" edc:mask="0x1" edc:name="SPI5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5BIF" edc:desc="" edc:mask="0x1" edc:name="I2C5BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5SIF" edc:desc="" edc:mask="0x1" edc:name="I2C5SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C5MIF" edc:desc="" edc:mask="0x1" edc:name="I2C5MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6IF" edc:desc="" edc:mask="0x1" edc:name="SPI6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI6TX" edc:desc="" edc:mask="0x1" edc:name="SPI6TX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDHCIF" edc:desc="" edc:mask="0x1" edc:name="SDHCIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100A0" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="1" edc:access="---------n--nnnnnnn-nnnnnnnnn-nn" edc:cname="IFS6" edc:desc="" edc:impl="0x4feffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0--0000000-000000000-00" edc:name="IFS6" edc:nzwidth="32" edc:por="---------0--0000000-000000000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GLCDIF" edc:mask="0x1" edc:name="GLCDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GPUIF" edc:mask="0x1" edc:name="GPUIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCEOSIF" edc:mask="0x1" edc:name="ADCEOSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIF" edc:mask="0x1" edc:name="ADCARDYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIF" edc:mask="0x1" edc:name="ADCURDYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0EIF" edc:mask="0x1" edc:name="ADC0EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1EIF" edc:mask="0x1" edc:name="ADC1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2EIF" edc:mask="0x1" edc:name="ADC2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3EIF" edc:mask="0x1" edc:name="ADC3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4EIF" edc:mask="0x1" edc:name="ADC4EIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCGRPIF" edc:mask="0x1" edc:name="ADCGRPIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC7EIF" edc:mask="0x1" edc:name="ADC7EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0WIF" edc:mask="0x1" edc:name="ADC0WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1WIF" edc:mask="0x1" edc:name="ADC1WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC2WIF" edc:mask="0x1" edc:name="ADC2WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC3WIF" edc:mask="0x1" edc:name="ADC3WIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC4WIF" edc:mask="0x1" edc:name="ADC4WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADC7WIF" edc:mask="0x1" edc:name="ADC7WIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xff7fffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8100B0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F8100C0" edc:_begin="0xc0" edc:_end="0x130" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIE" edc:desc="" edc:mask="0x1" edc:name="IC5EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IE" edc:desc="" edc:mask="0x1" edc:name="IC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IE" edc:desc="" edc:mask="0x1" edc:name="OC5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIE" edc:desc="" edc:mask="0x1" edc:name="IC6EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IE" edc:desc="" edc:mask="0x1" edc:name="IC6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IE" edc:desc="" edc:mask="0x1" edc:name="OC6IE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
