Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F8102F0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC27" edc:desc="" edc:impl="0xffffff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1EIS" edc:desc="" edc:mask="0x3" edc:name="SPI1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1EIP" edc:desc="" edc:mask="0x7" edc:name="SPI1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffff00" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810300" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC28" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1EIS" edc:desc="" edc:mask="0x3" edc:name="U1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1EIP" edc:desc="" edc:mask="0x7" edc:name="U1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U1RXIS" edc:desc="" edc:mask="0x3" edc:name="U1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1RXIP" edc:desc="" edc:mask="0x7" edc:name="U1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U1TXIS" edc:desc="" edc:mask="0x3" edc:name="U1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1TXIP" edc:desc="" edc:mask="0x7" edc:name="U1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1BIS" edc:desc="" edc:mask="0x3" edc:name="I2C1BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1BIP" edc:desc="" edc:mask="0x7" edc:name="I2C1BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810310" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C1SIS" edc:desc="" edc:mask="0x3" edc:name="I2C1SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1SIP" edc:desc="" edc:mask="0x7" edc:name="I2C1SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1MIS" edc:desc="" edc:mask="0x3" edc:name="I2C1MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1MIP" edc:desc="" edc:mask="0x7" edc:name="I2C1MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNAIS" edc:desc="" edc:mask="0x3" edc:name="CNAIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNAIP" edc:desc="" edc:mask="0x7" edc:name="CNAIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNBIS" edc:desc="" edc:mask="0x3" edc:name="CNBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNBIP" edc:desc="" edc:mask="0x7" edc:name="CNBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810320" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNCIS" edc:desc="" edc:mask="0x3" edc:name="CNCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNCIP" edc:desc="" edc:mask="0x7" edc:name="CNCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNDIS" edc:desc="" edc:mask="0x3" edc:name="CNDIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNDIP" edc:desc="" edc:mask="0x7" edc:name="CNDIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNEIS" edc:desc="" edc:mask="0x3" edc:name="CNEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNEIP" edc:desc="" edc:mask="0x7" edc:name="CNEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNFIS" edc:desc="" edc:mask="0x3" edc:name="CNFIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNFIP" edc:desc="" edc:mask="0x7" edc:name="CNFIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810330" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC31" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNGIS" edc:desc="" edc:mask="0x3" edc:name="CNGIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNGIP" edc:desc="" edc:mask="0x7" edc:name="CNGIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNHIS" edc:desc="" edc:mask="0x3" edc:name="CNHIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNHIP" edc:desc="" edc:mask="0x7" edc:name="CNHIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNJIS" edc:desc="" edc:mask="0x3" edc:name="CNJIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNJIP" edc:desc="" edc:mask="0x7" edc:name="CNJIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNKIS" edc:desc="" edc:mask="0x3" edc:name="CNKIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNKIP" edc:desc="" edc:mask="0x7" edc:name="CNKIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810340" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC32" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMPIS" edc:desc="" edc:mask="0x3" edc:name="PMPIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PMPIP" edc:desc="" edc:mask="0x7" edc:name="PMPIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PMPEIS" edc:desc="" edc:mask="0x3" edc:name="PMPEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PMPEIP" edc:desc="" edc:mask="0x7" edc:name="PMPEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP1IS" edc:desc="" edc:mask="0x3" edc:name="CMP1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP1IP" edc:desc="" edc:mask="0x7" edc:name="CMP1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP2IS" edc:desc="" edc:mask="0x3" edc:name="CMP2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CMP2IP" edc:desc="" edc:mask="0x7" edc:name="CMP2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810350" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC33" edc:desc="" edc:impl="0xe0ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC33" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USBIS" edc:desc="" edc:mask="0x3" edc:name="USBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBIP" edc:desc="" edc:mask="0x7" edc:name="USBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBDMAIS" edc:desc="" edc:mask="0x3" edc:name="USBDMAIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBDMAIP" edc:desc="" edc:mask="0x7" edc:name="USBDMAIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:desc="" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:desc="" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xe0ffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810360" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC34" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC34" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:desc="" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:desc="" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:desc="" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:desc="" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810370" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC35" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC35" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2EIS" edc:desc="" edc:mask="0x3" edc:name="SPI2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIP" edc:desc="" edc:mask="0x7" edc:name="SPI2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810380" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC36" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC36" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI2TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2EIS" edc:desc="" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:desc="" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:desc="" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:desc="" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:desc="" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:desc="" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810390" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC37" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC37" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2BIS" edc:desc="" edc:mask="0x3" edc:name="I2C2BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BIP" edc:desc="" edc:mask="0x7" edc:name="I2C2BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:desc="" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:desc="" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:desc="" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:desc="" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103A0" edc:_begin="0x140" edc:_end="0x4a0" edc:_modsrc="DOS-02907_WACB_int_evic_v3.Module" edc:_refcount="3" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC38" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC38" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN2IS" edc:desc="" edc:mask="0x3" edc:name="CAN2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN2IP" edc:desc="" edc:mask="0x7" edc:name="CAN2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ETHIS" edc:desc="" edc:mask="0x3" edc:name="ETHIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ETHIP" edc:desc="" edc:mask="0x7" edc:name="ETHIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3EIS" edc:desc="" edc:mask="0x3" edc:name="SPI3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3EIP" edc:desc="" edc:mask="0x7" edc:name="SPI3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
