Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F8E3008" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnrrrrrrrr--------nnnnnnn-" edc:cname="USBCSR2" edc:desc="" edc:impl="0xffff00fe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000011000000000--------1111111-" edc:name="USBCSR2" edc:nzwidth="32" edc:por="0000011000000000--------1111111-" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EP1RXIE" edc:desc="" edc:mask="0x1" edc:name="EP1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP2RXIE" edc:desc="" edc:mask="0x1" edc:name="EP2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP3RXIE" edc:desc="" edc:mask="0x1" edc:name="EP3RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP4RXIE" edc:desc="" edc:mask="0x1" edc:name="EP4RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP5RXIE" edc:desc="" edc:mask="0x1" edc:name="EP5RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP6RXIE" edc:desc="" edc:mask="0x1" edc:name="EP6RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EP7RXIE" edc:desc="" edc:mask="0x1" edc:name="EP7RXIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SUSPIF" edc:desc="" edc:mask="0x1" edc:name="SUSPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESUMEIF" edc:desc="" edc:mask="0x1" edc:name="RESUMEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESETIF" edc:desc="" edc:mask="0x1" edc:name="RESETIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOFIF" edc:desc="" edc:mask="0x1" edc:name="SOFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONNIF" edc:desc="" edc:mask="0x1" edc:name="CONNIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISCONIF" edc:desc="" edc:mask="0x1" edc:name="DISCONIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SESSRQIF" edc:desc="" edc:mask="0x1" edc:name="SESSRQIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBUSERRIF" edc:desc="" edc:mask="0x1" edc:name="VBUSERRIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SUSPIE" edc:desc="" edc:mask="0x1" edc:name="SUSPIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESUMEIE" edc:desc="" edc:mask="0x1" edc:name="RESUMEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RESETIE" edc:desc="" edc:mask="0x1" edc:name="RESETIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOFIE" edc:desc="" edc:mask="0x1" edc:name="SOFIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONNIE" edc:desc="" edc:mask="0x1" edc:name="CONNIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISCONIE" edc:desc="" edc:mask="0x1" edc:name="DISCONIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SESSRQIE" edc:desc="" edc:mask="0x1" edc:name="SESSRQIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBUSERRIE" edc:desc="" edc:mask="0x1" edc:name="VBUSERRIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E300C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnn----nnnn-----nnnnnnnnnnn" edc:cname="USBCSR3" edc:desc="" edc:impl="0xff0f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000----0000-----00000000000" edc:name="USBCSR3" edc:nzwidth="32" edc:por="00000000----0000-----00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RFRMNUM" edc:desc="" edc:mask="0x7ff" edc:name="RFRMNUM" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="ENDPOINT" edc:desc="" edc:mask="0xf" edc:name="ENDPOINT" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="NAK" edc:desc="" edc:mask="0x1" edc:name="NAK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TESTJ" edc:desc="" edc:mask="0x1" edc:name="TESTJ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TESTK" edc:desc="" edc:mask="0x1" edc:name="TESTK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PACKET" edc:desc="" edc:mask="0x1" edc:name="PACKET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEHS" edc:desc="" edc:mask="0x1" edc:name="FORCEHS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEFS" edc:desc="" edc:mask="0x1" edc:name="FORCEFS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFOACC" edc:desc="" edc:mask="0x1" edc:name="FIFOACC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FORCEHST" edc:desc="" edc:mask="0x1" edc:name="FORCEHST" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:MuxedSFRDef edc:_addr="0x1F8E3010" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:nzwidth="32" ltx:memberofperipheral="USB">
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:when="($0xc &amp; 0xf0000) == 0x0">
          <edc:SFRDef edc:_addr="0x1F8E3010" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="USBIE0CSR0" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="USBIE0CSR0" edc:nzwidth="32" edc:por="-----00000000000-----00000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="TXMAXP" edc:nzwidth="11"/>
                <edc:AdjustPoint edc:offset="5"/>
                <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="" edc:mask="0x1" edc:name="RXRDY" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="" edc:mask="0x1" edc:name="TXRDY" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STALLED" edc:desc="" edc:mask="0x1" edc:name="STALLED" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SETUP" edc:desc="" edc:mask="0x1" edc:name="SETUP" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="REQPKT" edc:desc="" edc:mask="0x1" edc:name="REQPKT" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STATUS" edc:desc="" edc:mask="0x1" edc:name="STATUS" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NAKTO" edc:desc="" edc:mask="0x1" edc:name="NAKTO" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x1" edc:name="DT" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DTWE" edc:desc="" edc:mask="0x1" edc:name="DTWE" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="19"/>
                <edc:SFRFieldDef edc:cname="DATAEND" edc:desc="" edc:mask="0x1" edc:name="DATAEND" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SETEND" edc:desc="" edc:mask="0x1" edc:name="SETEND" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="STALL" edc:desc="" edc:mask="0x1" edc:name="STALL" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RXRDYC" edc:desc="" edc:mask="0x1" edc:name="RXRDYC" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SETENDC" edc:desc="" edc:mask="0x1" edc:name="SETENDC" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1">
          <edc:SFRDef edc:_addr="0x1F8E3010" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBIENCSR0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBIENCSR0" edc:nmmrid="1896" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="TXMAXP" edc:nzwidth="11"/>
                <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
                <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="TXPKTRDY" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FIFONE" edc:desc="" edc:mask="0x1" edc:name="FIFONE" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SETUPPKT" edc:desc="" edc:mask="0x1" edc:name="SETUPPKT" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NAKTMOUT" edc:desc="" edc:mask="0x1" edc:name="NAKTMOUT" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DTWREN" edc:desc="" edc:mask="0x1" edc:name="DTWREN" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="FRCDATTG" edc:desc="" edc:mask="0x1" edc:name="FRCDATTG" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1" edc:name="MODE" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="AUTOSET" edc:desc="" edc:mask="0x1" edc:name="AUTOSET" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:AdjustPoint edc:offset="18"/>
                <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="" edc:mask="0x1" edc:name="UNDERRUN" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="INCOMPTX" edc:desc="" edc:mask="0x1" edc:name="INCOMPTX" edc:nzwidth="1"/>
                <edc:AdjustPoint edc:offset="6"/>
                <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
      </edc:MuxedSFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3014" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnrnnnnnrnrnnnnnnnnnnnnnnnnn" edc:cname="USBIENCSR1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBIENCSR1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="RXMAXP" edc:nzwidth="11"/>
            <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="RXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="RXPKTRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFOFULL" edc:desc="" edc:mask="0x1" edc:name="FIFOFULL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DERRNAKT" edc:desc="" edc:mask="0x1" edc:name="DERRNAKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REQPKT" edc:desc="" edc:mask="0x1" edc:name="REQPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPRX" edc:desc="" edc:mask="0x1" edc:name="INCOMPRX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATWEN" edc:desc="" edc:mask="0x1" edc:name="DATATWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PIDERR" edc:desc="" edc:mask="0x1" edc:name="PIDERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTORQ" edc:desc="" edc:mask="0x1" edc:name="AUTORQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTOCLR" edc:desc="" edc:mask="0x1" edc:name="AUTOCLR" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="" edc:mask="0x1" edc:name="OVERRUN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATAERR" edc:desc="" edc:mask="0x1" edc:name="DATAERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="DISNYET" edc:desc="" edc:mask="0x1" edc:name="DISNYET" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
