Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/edc/PIC32MZ1064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA954" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA85" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA85" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2115" edc:desc="" edc:mask="0xf" edc:name="PIXEL2115" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2114" edc:desc="" edc:mask="0xf" edc:name="PIXEL2114" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2113" edc:desc="" edc:mask="0xf" edc:name="PIXEL2113" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2112" edc:desc="" edc:mask="0xf" edc:name="PIXEL2112" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2111" edc:desc="" edc:mask="0xf" edc:name="PIXEL2111" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2110" edc:desc="" edc:mask="0xf" edc:name="PIXEL2110" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL219" edc:desc="" edc:mask="0xf" edc:name="PIXEL219" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL218" edc:desc="" edc:mask="0xf" edc:name="PIXEL218" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA958" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA86" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA86" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2123" edc:desc="" edc:mask="0xf" edc:name="PIXEL2123" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2122" edc:desc="" edc:mask="0xf" edc:name="PIXEL2122" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2121" edc:desc="" edc:mask="0xf" edc:name="PIXEL2121" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2120" edc:desc="" edc:mask="0xf" edc:name="PIXEL2120" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2119" edc:desc="" edc:mask="0xf" edc:name="PIXEL2119" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2118" edc:desc="" edc:mask="0xf" edc:name="PIXEL2118" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2117" edc:desc="" edc:mask="0xf" edc:name="PIXEL2117" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2116" edc:desc="" edc:mask="0xf" edc:name="PIXEL2116" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA95C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA87" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA87" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2131" edc:desc="" edc:mask="0xf" edc:name="PIXEL2131" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2130" edc:desc="" edc:mask="0xf" edc:name="PIXEL2130" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2129" edc:desc="" edc:mask="0xf" edc:name="PIXEL2129" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2128" edc:desc="" edc:mask="0xf" edc:name="PIXEL2128" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2127" edc:desc="" edc:mask="0xf" edc:name="PIXEL2127" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2126" edc:desc="" edc:mask="0xf" edc:name="PIXEL2126" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2125" edc:desc="" edc:mask="0xf" edc:name="PIXEL2125" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2124" edc:desc="" edc:mask="0xf" edc:name="PIXEL2124" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA960" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA88" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA88" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL227" edc:desc="" edc:mask="0xf" edc:name="PIXEL227" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL226" edc:desc="" edc:mask="0xf" edc:name="PIXEL226" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL225" edc:desc="" edc:mask="0xf" edc:name="PIXEL225" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL224" edc:desc="" edc:mask="0xf" edc:name="PIXEL224" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL223" edc:desc="" edc:mask="0xf" edc:name="PIXEL223" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL222" edc:desc="" edc:mask="0xf" edc:name="PIXEL222" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL221" edc:desc="" edc:mask="0xf" edc:name="PIXEL221" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL220" edc:desc="" edc:mask="0xf" edc:name="PIXEL220" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA964" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA89" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA89" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2215" edc:desc="" edc:mask="0xf" edc:name="PIXEL2215" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2214" edc:desc="" edc:mask="0xf" edc:name="PIXEL2214" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2213" edc:desc="" edc:mask="0xf" edc:name="PIXEL2213" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2212" edc:desc="" edc:mask="0xf" edc:name="PIXEL2212" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2211" edc:desc="" edc:mask="0xf" edc:name="PIXEL2211" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2210" edc:desc="" edc:mask="0xf" edc:name="PIXEL2210" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL229" edc:desc="" edc:mask="0xf" edc:name="PIXEL229" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL228" edc:desc="" edc:mask="0xf" edc:name="PIXEL228" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA968" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA90" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA90" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2223" edc:desc="" edc:mask="0xf" edc:name="PIXEL2223" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2222" edc:desc="" edc:mask="0xf" edc:name="PIXEL2222" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2221" edc:desc="" edc:mask="0xf" edc:name="PIXEL2221" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2220" edc:desc="" edc:mask="0xf" edc:name="PIXEL2220" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2219" edc:desc="" edc:mask="0xf" edc:name="PIXEL2219" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2218" edc:desc="" edc:mask="0xf" edc:name="PIXEL2218" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2217" edc:desc="" edc:mask="0xf" edc:name="PIXEL2217" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2216" edc:desc="" edc:mask="0xf" edc:name="PIXEL2216" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA96C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA91" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA91" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2231" edc:desc="" edc:mask="0xf" edc:name="PIXEL2231" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2230" edc:desc="" edc:mask="0xf" edc:name="PIXEL2230" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2229" edc:desc="" edc:mask="0xf" edc:name="PIXEL2229" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2228" edc:desc="" edc:mask="0xf" edc:name="PIXEL2228" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2227" edc:desc="" edc:mask="0xf" edc:name="PIXEL2227" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2226" edc:desc="" edc:mask="0xf" edc:name="PIXEL2226" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2225" edc:desc="" edc:mask="0xf" edc:name="PIXEL2225" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2224" edc:desc="" edc:mask="0xf" edc:name="PIXEL2224" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA970" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA92" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA92" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL237" edc:desc="" edc:mask="0xf" edc:name="PIXEL237" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL236" edc:desc="" edc:mask="0xf" edc:name="PIXEL236" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL235" edc:desc="" edc:mask="0xf" edc:name="PIXEL235" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL234" edc:desc="" edc:mask="0xf" edc:name="PIXEL234" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL233" edc:desc="" edc:mask="0xf" edc:name="PIXEL233" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL232" edc:desc="" edc:mask="0xf" edc:name="PIXEL232" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL231" edc:desc="" edc:mask="0xf" edc:name="PIXEL231" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL230" edc:desc="" edc:mask="0xf" edc:name="PIXEL230" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA974" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA93" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA93" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2315" edc:desc="" edc:mask="0xf" edc:name="PIXEL2315" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2314" edc:desc="" edc:mask="0xf" edc:name="PIXEL2314" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2313" edc:desc="" edc:mask="0xf" edc:name="PIXEL2313" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2312" edc:desc="" edc:mask="0xf" edc:name="PIXEL2312" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2311" edc:desc="" edc:mask="0xf" edc:name="PIXEL2311" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2310" edc:desc="" edc:mask="0xf" edc:name="PIXEL2310" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL239" edc:desc="" edc:mask="0xf" edc:name="PIXEL239" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL238" edc:desc="" edc:mask="0xf" edc:name="PIXEL238" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
